In [1]:
import pandas as pd

## 1. Given two datasets, how to join them together so that all the information is included?

In [2]:
p1 = pd.DataFrame({'key':[1,2,3], 
                   'A':[20, 21, 18],
                   'B':[4,5,7],
                  'C':[3,4,5]} )

In [3]:
p1

    A  B  C  key
0  20  4  3    1
1  21  5  4    2
2  18  7  5    3

In [4]:
p2 = pd.DataFrame({'key':[1,2,3], 
                   'D':[8, 9, 18],
                   } )

In [5]:
p2

    D  key
0   8    1
1   9    2
2  18    3

In [6]:
p1.set_index('key').join(p2.set_index('key'))

      A  B  C   D
key
1    20  4  3   8
2    21  5  4   9
3    18  7  5  18

## 2. How to transpose a DataFrame

In [8]:
df_q2 = pd.DataFrame({'A':[4,5],'B':[1,2]},index=['a','b'])

In [9]:
df_q2

   A  B
a  4  1
b  5  2

In [12]:
df_q2.transpose()

   a  b
A  4  5
B  1  2

## 3. How to reshape wide to long in pandas

In [13]:
df = pd.DataFrame({
    'date' : ['05/03', '06/03', '07/03', '08/03'],
    'AA' : [1, 4, 7, 5],
    'BB' : [2, 5, 8, 7],
    'CC' : [3, 6, 9, 1]
}).set_index('date')

In [45]:
df

       AA  BB  CC
date
05/03   1   2   3
06/03   4   5   6
07/03   7   8   9
08/03   5   7   1

In [20]:
df.unstack().reset_index()

   level_0   date  0
0       AA  05/03  1
1       AA  06/03  4
2       AA  07/03  7
3       AA  08/03  5
4       BB  05/03  2
5       BB  06/03  5
6       BB  07/03  8
7       BB  08/03  7
8       CC  05/03  3
9       CC  06/03  6
10      CC  07/03  9
11      CC  08/03  1

## 4. How to merge two tables together?

In [28]:
df_1 = pd.DataFrame({'key':['a','b','c','d'],'data1':range(4)})

In [29]:
df_1

   data1 key
0      0   a
1      1   b
2      2   c
3      3   d

In [30]:
df_2 = pd.DataFrame({'key':['b','b','c','c'],'data2':range(4)})

In [31]:
df_2

   data2 key
0      0   b
1      1   b
2      2   c
3      3   c

In [32]:
# left outer join
df_1.merge(df_2,how='left',on='key')

   data1 key  data2
0      0   a    NaN
1      1   b    0.0
2      1   b    1.0
3      2   c    2.0
4      2   c    3.0
5      3   d    NaN

In [33]:
# inner join
df_1.merge(df_2,how='inner',on='key')

   data1 key  data2
0      1   b      0
1      1   b      1
2      2   c      2
3      2   c      3

## 5. How to join two tables together with overlap column name?

In [35]:
#use rsuffix keyword
df_1.join(df_2,rsuffix='_2')

   data1 key  data2 key_2
0      0   a      0     b
1      1   b      1     b
2      2   c      2     c
3      3   d      3     c

## 6. How to concatenate two tables together?

In [37]:
df1 = pd.DataFrame({'a':range(3),'b':range(3)})

In [40]:
df1

   a  b
0  0  0
1  1  1
2  2  2

In [39]:
df2 = pd.DataFrame({'a':range(4)})

In [41]:
df2

   a
0  0
1  1
2  2
3  3

In [43]:
pd.concat([df1,df2])

   a    b
0  0  0.0
1  1  1.0
2  2  2.0
0  0  NaN
1  1  NaN
2  2  NaN
3  3  NaN

In [44]:
pd.concat([df1,df2],join='inner',ignore_index=True)

   a
0  0
1  1
2  2
3  0
4  1
5  2
6  3

## 7. How to use pivotal table to convert table?

In [46]:
df = pd.DataFrame({'Date':['1990-01-02','1990-01-02','1990-01-02',
                           '1990-01-03','1990-01-03','1990-01-03',
                           '1990-01-04','1990-01-04','1990-01-04'],
                   'Ticker':['AAPL','GS','JPM',
                            'AAPL','GS','JPM',
                            'AAPL','GS','JPM'],
                   'Adj_price':[100,20,50,101,21,51,110,24,30]})

In [47]:
df

   Adj_price        Date Ticker
0        100  1990-01-02   AAPL
1         20  1990-01-02     GS
2         50  1990-01-02    JPM
3        101  1990-01-03   AAPL
4         21  1990-01-03     GS
5         51  1990-01-03    JPM
6        110  1990-01-04   AAPL
7         24  1990-01-04     GS
8         30  1990-01-04    JPM

In [50]:
df.pivot(index ='Date',columns ='Ticker',values ='Adj_price')

Ticker      AAPL  GS  JPM
Date
1990-01-02   100  20   50
1990-01-03   101  21   51
1990-01-04   110  24   30